package com.xmzj.entity.response;

public class BookChapterContentResponse {
    /**
     * code : 0
     * data : {"author":"","content":"永嘉大师《证道歌》调古神清，有足多者，而宏德上人注释亦有独到之处，今熔于一炉，间参我见，作《解脱歌》。\r\n\r\n　　觉后乐，乐如何？听我教唱解脱歌，不让古人风调高，我今何妨拈句和。\r\n　　本无妄，亦无真，原来二法空无性，无性无相不着空，即是如来真实性。\r\n　　见实相，诸法空，刹那顿悟万法同，一旦风光藏不住，赤裸裸的觌面逢。\r\n　　决定说，佛心印，有人不肯如实信，直截根源当下了，摘叶寻枝渐教人。\r\n　　几回生，几回死，亘古亘今长如此，神头鬼面有多般，返本还元没些子。\r\n　　习显教，修密宗，方便门异归元同，自从踏遍涅槃路，了知生死本来空。\r\n　　行也空，坐也空，语默动静无不空，纵将白刃临头颅，犹如利剑斩春风。\r\n　　顿觉了，妙心源，无明壳裂总一般，梦里明明有六趣，觉后空空无圣凡。\r\n　　烦恼本，即菩提，罪福没性何处觅，无绳自缚解脱后，大摇大摆大休息。\r\n　　莫攀缘，莫执著，随缘随份随饮啄，不变随缘行无碍，自在随心大安乐。\r\n　　但得本，莫愁末，妙用纵横活泼泼，弹指敲开不二门，升堂直入如来屋。\r\n　　宗亦通，说亦通，团团杲日丽晴空，百千三昧无量义，只在寻常日用中。\r\n　　觉心体，生佛同，有情无情共鼻孔，无缚无脱无遮障，迷时自碍悟自通。\r\n　　无形相，极灵妙，非亲证知那能晓，镜里看影虽不难，水底捉月怎办到！\r\n　　狮子吼，无畏说，百兽闻之皆咋舌，香象奔波失却威，天龙寂听生欣悦。\r\n　　狮子儿，众随后，三岁即能大哮吼，若是野犴逐法王，百千妖怪虚开口。\r\n　　谁无念，谁无生，莫将镜影认作真，若以断灭为究竟，何异外道邪见人。\r\n　　大丈夫，秉慧剑，般若锋兮金刚焰，非但能摧外道心，并且破除邪魔见。\r\n　　震法雷，击法鼓，海水奔腾须弥舞，毛头许里乾坤定，大千沙界寸土无。\r\n　　让他谤，任他毁，把火烧天徒自累，我闻恰是空中风，何碍甚深大三昧！\r\n　　一切声，皆实相，恶言善语无二样，不因谤赞别冤亲，方契本心平等相。\r\n　　赞无增，谤无减，空中鸟迹著云天，太虚饮光消契阔，幽谷回声话晚烟。\r\n　　默时说，说时默，大施门开无壅塞，有人问我解何宗？我为摩诃般若客。\r\n　　昔曾说，今懒说，山河大地广长舌，或是或非人不识，逆行顺行天莫测！\r\n　　常独行，常独步，脚底草鞋狞似虎，举趾粉碎金刚地，不觉踏断来时路。\r\n　　疯颠汉，无字经，信口掉舌说不尽，海底金乌天上日，目中童子眼前人。\r\n　　觉即了，不施功，物我俱亡心境空，菡萏枝枝撑夜月，木樨叶叶扇香风。\r\n　　有等人，寻经论，终年求解不起行，分别名相那知休，入海算沙徒自辛。\r\n　　佛当日，曾叮咛，数他珍宝无己分，从来蹭蹬行不利，难免枉堕文字坑。\r\n　　亦愚痴，亦憨呆，海市蜃楼生实解，执指为月枉施功，根尘法中盲摩揣。\r\n　　心为根，境为尘，两种犹如镜上痕，痕垢尽净光始现，心境双亡性乃真。\r\n　　非不非，是不是，毫厘差之千里失，是即龙女顿成佛，非则善星人身失。\r\n　　种性邪，错知解，不达如来本性怀，二乘苦行非究竟，外道练身终必坏。\r\n　　不思议，解脱力，恒沙大地载不起，摩诃般若波罗蜜，甚深般若波罗蜜。\r\n　　圆顿教，没人情，翻身踏倒涅槃城，威音那畔至今日，好个风流画不成！\r\n　　方便门，善巧开，火中生莲终不坏，勇施犯重悟无生，早已成佛无障碍。\r\n　　一切处，悉兰若，无闹无静无牵挂，怡然幽居无遮殿，游戏人间实潇洒。\r\n　　江月照，松风吹，更于何处觅作为，万世古今如电拂，三千刹海一芦苇。\r\n　　旃檀林，无杂树，郁密幽深狮子住，境静林间独自游，走兽飞禽皆远去。\r\n　　心境明，照无碍，廓然莹彻周法界，万象森罗隐现中，一颗圆明无内外。\r\n　　日可冷，月可热，邪见何能坏真说，无筋空力大无比，螳螂岂能拒车辙？\r\n　　如实唱，如实听，未曾开口已和竟，三世诸佛齐唱和，尽未来际无穷尽。\r\n\r\n　　歌毕不觉哈哈大笑，和者喝曰：不怕开了口合不得吗？诸人且道，这疯汉哈哈大笑，毕竟作么生？"}
     */

    private int code;
    private DataBean data;

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public DataBean getData() {
        return data;
    }

    public void setData(DataBean data) {
        this.data = data;
    }

    public static class DataBean {
        /**
         * author :
         * content : 永嘉大师《证道歌》调古神清，有足多者，而宏德上人注释亦有独到之处，今熔于一炉，间参我见，作《解脱歌》。

         　　觉后乐，乐如何？听我教唱解脱歌，不让古人风调高，我今何妨拈句和。
         　　本无妄，亦无真，原来二法空无性，无性无相不着空，即是如来真实性。
         　　见实相，诸法空，刹那顿悟万法同，一旦风光藏不住，赤裸裸的觌面逢。
         　　决定说，佛心印，有人不肯如实信，直截根源当下了，摘叶寻枝渐教人。
         　　几回生，几回死，亘古亘今长如此，神头鬼面有多般，返本还元没些子。
         　　习显教，修密宗，方便门异归元同，自从踏遍涅槃路，了知生死本来空。
         　　行也空，坐也空，语默动静无不空，纵将白刃临头颅，犹如利剑斩春风。
         　　顿觉了，妙心源，无明壳裂总一般，梦里明明有六趣，觉后空空无圣凡。
         　　烦恼本，即菩提，罪福没性何处觅，无绳自缚解脱后，大摇大摆大休息。
         　　莫攀缘，莫执著，随缘随份随饮啄，不变随缘行无碍，自在随心大安乐。
         　　但得本，莫愁末，妙用纵横活泼泼，弹指敲开不二门，升堂直入如来屋。
         　　宗亦通，说亦通，团团杲日丽晴空，百千三昧无量义，只在寻常日用中。
         　　觉心体，生佛同，有情无情共鼻孔，无缚无脱无遮障，迷时自碍悟自通。
         　　无形相，极灵妙，非亲证知那能晓，镜里看影虽不难，水底捉月怎办到！
         　　狮子吼，无畏说，百兽闻之皆咋舌，香象奔波失却威，天龙寂听生欣悦。
         　　狮子儿，众随后，三岁即能大哮吼，若是野犴逐法王，百千妖怪虚开口。
         　　谁无念，谁无生，莫将镜影认作真，若以断灭为究竟，何异外道邪见人。
         　　大丈夫，秉慧剑，般若锋兮金刚焰，非但能摧外道心，并且破除邪魔见。
         　　震法雷，击法鼓，海水奔腾须弥舞，毛头许里乾坤定，大千沙界寸土无。
         　　让他谤，任他毁，把火烧天徒自累，我闻恰是空中风，何碍甚深大三昧！
         　　一切声，皆实相，恶言善语无二样，不因谤赞别冤亲，方契本心平等相。
         　　赞无增，谤无减，空中鸟迹著云天，太虚饮光消契阔，幽谷回声话晚烟。
         　　默时说，说时默，大施门开无壅塞，有人问我解何宗？我为摩诃般若客。
         　　昔曾说，今懒说，山河大地广长舌，或是或非人不识，逆行顺行天莫测！
         　　常独行，常独步，脚底草鞋狞似虎，举趾粉碎金刚地，不觉踏断来时路。
         　　疯颠汉，无字经，信口掉舌说不尽，海底金乌天上日，目中童子眼前人。
         　　觉即了，不施功，物我俱亡心境空，菡萏枝枝撑夜月，木樨叶叶扇香风。
         　　有等人，寻经论，终年求解不起行，分别名相那知休，入海算沙徒自辛。
         　　佛当日，曾叮咛，数他珍宝无己分，从来蹭蹬行不利，难免枉堕文字坑。
         　　亦愚痴，亦憨呆，海市蜃楼生实解，执指为月枉施功，根尘法中盲摩揣。
         　　心为根，境为尘，两种犹如镜上痕，痕垢尽净光始现，心境双亡性乃真。
         　　非不非，是不是，毫厘差之千里失，是即龙女顿成佛，非则善星人身失。
         　　种性邪，错知解，不达如来本性怀，二乘苦行非究竟，外道练身终必坏。
         　　不思议，解脱力，恒沙大地载不起，摩诃般若波罗蜜，甚深般若波罗蜜。
         　　圆顿教，没人情，翻身踏倒涅槃城，威音那畔至今日，好个风流画不成！
         　　方便门，善巧开，火中生莲终不坏，勇施犯重悟无生，早已成佛无障碍。
         　　一切处，悉兰若，无闹无静无牵挂，怡然幽居无遮殿，游戏人间实潇洒。
         　　江月照，松风吹，更于何处觅作为，万世古今如电拂，三千刹海一芦苇。
         　　旃檀林，无杂树，郁密幽深狮子住，境静林间独自游，走兽飞禽皆远去。
         　　心境明，照无碍，廓然莹彻周法界，万象森罗隐现中，一颗圆明无内外。
         　　日可冷，月可热，邪见何能坏真说，无筋空力大无比，螳螂岂能拒车辙？
         　　如实唱，如实听，未曾开口已和竟，三世诸佛齐唱和，尽未来际无穷尽。

         　　歌毕不觉哈哈大笑，和者喝曰：不怕开了口合不得吗？诸人且道，这疯汉哈哈大笑，毕竟作么生？
         */

        private String author;
        private String content;

        public String getAuthor() {
            return author;
        }

        public void setAuthor(String author) {
            this.author = author;
        }

        public String getContent() {
            return content;
        }

        public void setContent(String content) {
            this.content = content;
        }
    }
}
